Revit 2015 API
IFCAnyHandle.SetAttribute Method (String, ICollection<String>)
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
[ObsoleteAttribute("This method is obsolete in Revit 2015. Use SetAttribute(string, IList<string>) or SetAttribute(string, ISet<string>) instead.")]
public void SetAttribute(
	string name,
	ICollection<string> values
)
Visual Basic
<ObsoleteAttribute("This method is obsolete in Revit 2015. Use SetAttribute(string, IList<string>) or SetAttribute(string, ISet<string>) instead.")> _
Public Sub SetAttribute ( _
	name As String, _
	values As ICollection(Of String) _
)
Visual C++
[ObsoleteAttribute(L"This method is obsolete in Revit 2015. Use SetAttribute(string, IList<string>) or SetAttribute(string, ISet<string>) instead.")]
public:
void SetAttribute(
	String^ name,
	ICollection<String^>^ values
)
Parameters
name
Type: System.String
values
Type: System.Collections.Generic.ICollection<String>
See Also
IFCAnyHandle Class
SetAttribute Overload
Autodesk.Revit.DB.IFC Namespace